
public class G_Stack_Queue_concept {

	public static void main(String[] args) {
		// 스택 & 큐 알고리즘. 슬라이딩 윈도우는 나중에... 투포인터가 손에 익으면
		// [스택] :
		// 후입 선출이 특징인 자료구조.
		// pop으로 가장 마지막으로 들어간 값을 빼버린다.
		// top : 삽입/삭제가 이뤄지는 위치.
		// push : top 위치에 새로운 값을 산입하는 연산.
		// pop : top 위치에 있는 데이터를 삭제하고 확인하는 연산.
		// peek : top 위치에 있는 데이터를 조회하는 연산.

		// [큐] :
		// 선입 선출로 삽입과 삭제가 이뤄지는 연산. 먼저 들어온게 먼저 나간다.
		// 삽입은 맨 뒤에, 삭제는 먼저 들어간 곳에서.
		// rear : Queue에서 가장 끝 위치를 가리키는 영역
		// front : Queue에서 가장 처음 위치를 가리키는 영역
		// add : rear 부분에 새로운 데이터를 산입하는 연산.
		// poll : front 부분의 데이터를 삭제하고 확인하는 연산.
		// peek : 스택과 상동. 확인만 한다.(front 부분)
		
	}

}
